Revit 2027 API
BuiltInFailures.FamilyFailures.ReferencePlanesOverconstrained Property
 Reference Planes are overconstrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReferencePlanesOverconstrained { get; }
Public Shared ReadOnly Property ReferencePlanesOverconstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReferencePlanesOverconstrained {
	FailureDefinitionId^ get ();
}
static member ReferencePlanesOverconstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace